#罐的设计
#设计一个1000立方厘米容积的直圆柱罐, 它的制作要考虑损耗
#切割侧面时无损耗, 但上下底是从边长2r的正方形铝板切出的
#所以总的消耗是A = 8*r**2 + 2*pi*r*h
#1000 = h*pi*r**2 => h = 1000/(pi*r**2) => a(x) = 8*r**2 + 2*pi*r*1000/(pi*r**2)
#= 8*r**2 + 2000/r
#在da/dr = 0时有局部最小值, 也是全局最小值
#16*r = 2000/r**2
#r**3 = 2000/16
#r = 5
#h/r = 2.546

def a(x):
    return 8*x**2 + 2000.0/x

def ad(x):
    return 16*x - 2000/x**2

def add(x):
    return 16 + 4000/x**3


x = linspace(1,20, 1000)
y = a(x)
yd= ad(x)
ydd= add(x)

plot([0, 20], [0, 0], '-k')
plot(x, y, '-r', x, yd, '-g', x, ydd, '-b')


