#箱子的设计
#一个24*36的硬纸板折叠成两个24*18的矩形, 然后从折出的两个矩形各自的四角
#切下边长为x的全等正方形, 展开纸板,折成盒子
#(a)写出体积公式 V(x) = 2*x*(24-2x)*(18-2x)
#(b)求V的定义域, x ∈ (0, 9)
#(c)用图形法求最大可能体积约在x = 3.4 取得最大体积 1310
#(d)解析地验证(c) 先求临界点, 解方程vd(x) = 0得到x1 = 3.3944和x2= 10.61
#   其中只有x1在定义域中, 然后考察二阶导数, 为负, x1处取得局部最大值
#   也是全局最大值
#(e)求出体积为1120的x

def v(x):
    return 8*x**3 - 168*x**2 + 864*x

def vd(x):
    return 24*x**2 - 336*x + 864

def vdd(x):
    return 48*x - 336


x = linspace(1,8, 1000)
y = v(x)
yd= vd(x)
ydd= vdd(x)

plot([0, 10], [0, 0], '-k')
plot(x, y, '-r', x, yd, '-g', x, ydd, '-b')

w = poly1d([8, -168, 864, -1120])
np.roots(w)


