#最短的杆
#8英尺高的墙离建筑物27英尺, 求能从墙外地面到建筑物边最短的杆
#用相似三角形不好建模, 我将矮墙顶视为P(-27, 8)的点
#点斜式: y - 8 = k(x + 27)
#=>          y = k*x + 27*k + 8
#=> 直线与x交点 0 = k*x + 27*k + 8
#=>             x =  -8/k - 27
#=> 直线与x交点 (-8/k - 27, 0)
#=> 直线与y交点 y = 27*k + 8 =>(0, 27*k + 8)
#L**2 = (-8/k - 27)**2 + (27*k + 8)**2 = 64/k**2  + 432/k + 729 + 729*k**2 + 432*k + 64
#(L**2)' = -128/k**3 - 432/k**2 + 1458*k + 432
#看出k约等于2/3时杆最短, 46.86ft
#xoozi 用斜率来建模, 我也算灵机一动 看了答案, 官方的方法更好一点


def Lsq(k):
    return 64/k**2  + 432/k + 729 + 729*k**2 + 432*k + 64

def Lsqd(k):
    return -128.0/k**3 - 432.0/k**2 + 1458*k + 432

x = linspace(0.25, 4, 1000)
y = Lsq(x)
yd= Lsqd(x)

plot([0, 10], [0, 0], '-k')
plot(x, y, '-r', x, yd, '-g')

