#两条船之间的距离
#正午时刻(12:00), 船A在船B北面12海里处
#船A以12节的速度向南行驶而且全天继续向南行驶
#船B以8节的速度向东行驶, 而且全天继续向东行驶
#(a)从正午t=0开始计算时间, 并把两船之间的距离表为t的函数
#(b)正午时刻两船间的距离变化有多快, 一小时后呢
#(c)那天的能见度是5海里, 两船能互相看见吗

#两船距离最小值仍大于5, 不可见


def dist(t):
    ##pos_a_0 = [0, 12]
    ##pos_b_0 = [0, 0]
    ##v_a = [0, -12]
    ##v_b = [8, 0]
    ##pos_a = [pos_a_0[0] + t*v_a[0], pos_a_0[1] + t*v_a[1]]
    ##pos_b = [pos_b_0[0] + t*v_b[0], pos_b_0[1] + t*v_b[1]]
    ##delta_x = pos_a[0] - pos_b[0]
    ##delta_y = pos_a[1] - pos_b[1]
    ##return sqrt(delta_x**2 + delta_y**2)
    #这种写法没法求导, 换一种
    return sqrt(208*t**2 - 288*t + 144)

def v(t):
    return (208*t - 144) / sqrt(208*t**2 - 288*t + 144)


plot([0, 6], [0, 0], '-k')

x = linspace(0, 6, 10000)
yd = dist(x)
yv = v(x)

plot(x, yd, '-r', x, yv, '-g')


