#销售背包
#制造和销售每一个背包的成本为c美元, 如果每个背包售出价x美元
#售出背包数由 n = a/(x - c) + b*(100 - x)
#给出, 其中a和b是正常数, 什么样的售出价格能带来最大利润
#边际成本 = 0
#收入 = x * n = a*x/(x - c) + b*x*(100 - x)
#边际收入 = (a*(x - c) - a*x)/(x - c)**2 + 100*b - 2*b*x
#          = -a*c/(x - c)**2 - 2*b*x + 100*b
#          = 0
#-a*c/(x**2 - 2*c*x + c**2) = 100*b - 2*b*x
#-a*c = 100*b*x**2 - 100*b*c*x + 100*b*c**2 - 2*b*x**3 + 4*b*c*x**2 - 2*b*c**2*x
# 0   = -2*b*x**3 + (100*b + 4*b*c)*x**2 - (100*b*c + 2*b*c**2)*x + 100*b*c**2 + a*c

#xoozi此题有点意思, 并不是让我们直接套用定理6, 因为这里的成本是固定的, 和定理6的模型不匹配
#按正规套路, 把利润表成x的函数
#利润p(x) = n*x - n*c = n*(x - c) = a + b*(100 - x)*(x - c)
#   = a + 100*b*x - 100*b*c - x**2 + c*x = -x**2 +(100*b + c)*x + a - 100*b*c
#pd(x) = -2*x + 100*b + c = 0
# 2*x = 100*b + c
#   x = (100*b + c)/2
