#最佳尺寸
#你正计划从8*15的一张硬纸板上在四角切去四个全等正方形再往上折起
#构成一个无盖长方盒子, 用这种方法做得体积最大的盒子尺寸是什么
#体积为多大
#设切去的正方形边长为x
#则, 长方盒子的底边长为15-2*x, 宽8-2*x
#体长方盒子体积 v(x) = x * (15 - 2*x) * (8 - 2*x)
#用局部极值的二阶导数验证法, 可以知道在vd(x) = 0处盒子体积有局部极大值
#也是全局最大值, 而vd(x) = 0有两处, 只有x = 1.66667处在定义域内

def v(x):
    return x * (15 - 2*x) * (8 - 2*x)

def vd(x):
    return 12*x**2 - 92*x + 120

def vdd(x):
    return 24*x - 92


x = linspace(0.2, 3, 1000)
y = v(x)
yd= vd(x)
ydd= vdd(x)

plot([0, 3], [0, 0], '-k')
plot(x, y, '-r', x, yd, '-g', x, ydd, '-b')

vdp = poly1d([12, -92, 120])
np.roots(vdp)
