#画函数以求出区间, 函数在这些区间上
#(a)增  [0.14, 1.399], [2.45, +∞)
#(b)减  (-∞, 0.14], (2, 2.45]
#(c)凹向上(-∞, 1], (2, +∞)
#(d)凹向下[1, 2)
#然后定位和识别
#(e)局部极值 x=0.14处取得局部极小值, x=1.399处取得局部极大值, x=2.45处取得局部极小值
#(f)拐点一阶导数增减性变化的点, 只有在x=1时二阶导数由正变负

#xoozi 此题做了我2小时
#刚开始做多项式计算频繁写错, 因为项太多
#后来用numpy的多项式类来算, pass了
#然后求拐点和临界点, 这无法配方我几乎以为没法做
#后来做图用原始数值计算的方法搞定了
#果然数值大法好, 这种题要求解析解的话题目要特别设计过才可以配方, 
#不能配方的题我以前就只能瞎了

def f(x):
    return (x**3 - 2*x**2 + x - 1) / (x - 2)

def fd(x):
    return (2*x**3 - 8*x**2 + 8*x - 1) / (x - 2)**2

def fdd(x):
    return 2 + (2*x - 4) / (x**4 - 8*x**3 + 24*x**2 - 32*x + 16)

plot([-6, 6], [0, 0], '-k')

x1 = linspace(-5, 1.95, 100)
y1 = f(x1)
x2 = linspace(2.05, 5, 100)
y2 = f(x2)
plot(x1, y1, '-r', x2, y2, '-r')


x1 = linspace(-5, 1.7, 100)
y1 = fd(x1)
x2 = linspace(2.4, 5, 100)
y2 = fd(x2)
plot(x1, y1, '-g', x2, y2, '-g')


x1 = linspace(-5, 1.7, 100)
y1 = fdd(x1)
x2 = linspace(2.4, 5, 100)
y2 = fdd(x2)
plot(x1, y1, '-b', x2, y2, '-b')
