#估计pi/4

#计划通过求arctan x的Maclaurin级数在x = 1处的值估计pi/4, 用交错级数估计定理确定级数的多少项相加看有保证估计精确到二位小数

#设f(x) = arctan x
#f'(x) = 1/(1 + x²) = (1 + x²)**(-1)
#f''(x) = -1 * 1 * 2x (1 + x²)**(-2)
#f'''(x) = 1 * 2! * (2x)² (1 + x²)**(-3)
#f''''(x) = -1 * 3! * (2x)³ (1 + x²)**(-4)
#...
#f**n(x) = (-1)**(n+1) n! * (2x)**(n-1) (1 + x²)**(-n)

#arctan x 的Maclaurin级数可以写成:
#0 + ∑(n=1, ∞) (-1)**(n + 1) n! (2)**(n-1)

#利用交错级数估计定理, 也就是找到第k项, 其|uk| < 0.01


#   xoozi, 坑爹, 结果答案中根本不是用的Maclaurin级数, 而是用的
#   arctan x = x - x³/3 + x**5/5 - x**7/7 + ...
#   pi/4 = 1 - 1/3 + 1/5 - 1/7 + ... un = 1/(2n + 1)
#   利用交错级数估计定理第n项的误差 |e| < |un+1| = |1/(2n + 3)| < 0.01
#   100 < 2n + 3 => 2n > 97 => n = 49

