'''
连续延拓到一点
我们在1.2节就知道了, 有理函数即使在其分母为0的点处, 也可能是连续的. 如果f(c)没有定义,
但lim(x->c)f(x) = L, 我们可以定义一个新函数F(x)
        f(x)
F(x) = 
        L,  x = c

F(x) 在x = c处连续, 这称为吧f(x)连续延拓到 x = c. 对有力函数而言, 连续延拓通常是通过
消去分子分母的公因子来求得

在题41-44中画出函数f的图形, 看看是否显示出可以连续延拓到源原点'''

#41 f(x) = (10**x - 1)/ x
#xoozi 此题求极限我还真不知的怎么求

#43 g(x) = sin(x) / |x|
#不能延续, 因为左右极限虽然存在 ,但不相等


def f(x):
    return (10**x - 1) / x



x1 = linspace(-2, -0.01, 100)
y1 = f(x1)
x2 = linspace(0.01, 2, 100)
y2 = f(x2)


xlabel('x')
ylabel('y')
plot(x1, y1, 'r-', x2, y2, 'r-')

def g(x):
    return sin(x)/ abs(x)

x3 = linspace(-2, -0.01, 100)
y3 = g(x3)
x4 = linspace(0.01, 2, 100)
y4 = g(x4)

plot(x3, y3, 'g-', x4, y4, 'g-')

