#水污染
#石油从海上受损的油轮泄漏, 油轮的损坏不断加重
#以致每小时的漏油量都在增加
#  时间(小时)      │0   1   2   3   4   5   6   7   8
#──────────────────┼─────────────────────────────────────
#  漏油(加仑/小时) │50  70  97  136 190 265 369 516 720
#
#(a)给出5小时后溢出石油总量的不足估计和过剩估计
#(b)给出8小时后溢出石油总量的不足估计和过剩估计
#(c)在前8小时之后油轮继续以720加仑/时的速率漏油.如果油轮原来
#装有25000加仑的石油, 近似地在最坏情形下再过多少小时漏完,
#最好情况之下呢?
def iv_fun_cnt(val_a, step, cnt):
    iv_sum = 0
    i = 0
    while(i < cnt):
        iv_sum += (val_a[i] * step)
        i = i + 1
    return iv_sum


v_left = [50, 70, 97, 136, 190, 265, 369, 516]
v_right = [70, 97, 136, 190, 265, 369, 516, 720]

m5_left = iv_fun_cnt(v_left, 1.0, 5)
m5_right = iv_fun_cnt(v_right, 1.0, 5)
m8_left = iv_fun_cnt(v_left, 1.0, 8)
m8_right = iv_fun_cnt(v_right, 1.0, 8)

print "5 hour:(%f, %f)" % (m5_left, m5_right)
print "8 hour:(%f, %f)" % (m8_left, m8_right)
#c有点不可理解,怎么会差这么多
