#三次函数
#考虑三次函数:  f(x) = a*x**3 + b*x**2 + c*x + d
#(a)证明f可以有或没有1个, 2个临界点, 给出例子和图形来支持理论
#   f'(x)   = 3*a*x**2 + 2*b*x + c
#解方程 0   = 3*a*x**2 + 2*b*x + c
#用求根公式x= (-2*b ± (4*b**2 - 12*a*c)**1/2) / 6*a
#          x= (-b ± (b**2 - 3*a*c)**1/2) / 3*a
#当b**2 - 3*a*c = 0时, 有一个临界点, 例如f1(x) = 3*x**3 + 3*x**2 + x + 1, 临界点为-b/3*a = -3/3*3 = -1/3
#当b**2 - 3*a*c > 0时, 有两个临界点, 例如f2(x) = 3*x**3 + 4*x**2 + x + 1, 临界点为-4 + (16 - 9)**1/2 / 6 = 
#当b**2 - 3*a*c < 0时, 没有临界点,   例如f3(x) = 3*x**3 + 2*x**2 + x + 1

def f1(x):
    return 3*x**3 + 3*x**2 + x + 1

def f2(x):
    return 3*x**3 + 4*x**2 + x + 1

def f3(x):
    return 3*x**3 + 2*x**2 + x + 1

x = linspace(-1.2, 0.3, 100)
y1= f1(x)
y2= f2(x)
y3= f3(x)

plot(x, y1, '-r', x, y2, '-g', x, y3, '-b')
#我这个随意指定的参数, 视觉效果不是十分明显, 仔细选择范围后可以看出, 两个临界点时, 函数图形的上下扭动, 一个临界点时, 中间有一个平行x轴的点, 没临界点时, 整个函数图形是倾斜的
#也许这样的不明显也比较真实
